Repository: kholyo18/unispace
Catalog: lib/l10n/intl_*.arb
Languages: ar, fr

source: Sections
ar: الأقسام

source: Majors
ar: تخصصات
fr: Spécialités

source: Comments
ar: التعليقات
fr: Commentaires

source: Comment
ar: تعليق
fr: Commentaire

source: Write your comment
ar: اكتب تعليقك
fr: Écrivez votre commentaire

source: Publish
ar: نشر
fr: Publier

source: Cancel
ar: إلغاء
fr: Annuler

# posted
source: Post
ar: منشور
fr: Publication

# searchClipboard
source: Search inside clipboard…
ar: ابحث داخل الحافظة…
fr: Rechercher dans le presse-papiers…

source: Note
ar: ملاحظة

source: Title
ar: العنوان
fr: Titre

source: Content
ar: المحتوى
fr: Contenu

source: Save
ar: حفظ
fr: Enregistrer

source: Pin Note
ar: تثبيت الملاحظة
fr: Épingler la note

source: No notes yet
ar: لا توجد ملاحظات بعد
fr: Aucune note pour le moment

source: Archive
ar: الأرشيف
fr: Archives

source: Home
ar: الرئيسية
fr: Accueil

source: Community
ar: المجتمع
fr: Communauté

source: View All
ar: عرض الكل
fr: Voir tout

source: Faculties
ar: الكليات
fr: Facultés

source: Clipboard
ar: الحافظة
fr: Presse-papiers

source: Change Theme
ar: تغيير المظهر
fr: Changer le thème

source: Change Language
ar: تغيير اللغة
fr: Changer la langue

source: Reset Password
ar: إعادة تعيين كلمة المرور
fr: Réinitialiser le mot de passe

source: Logout
ar: تسجيل الخروج
fr: Se déconnecter

source: Login
ar: تسجيل الدخول
fr: Se connecter

# aboutApp
source: About the App
ar: حول التطبيق
fr: À propos de l'application

source: Privacy Policy
ar: سياسة الخصوصية
fr: Politique de confidentialité

source: Contact Us
ar: تواصل معنا
fr: Contactez-nous

source: Subject
ar: الموضوع
fr: Sujet

# writeMessageHint
source: Write your message here...
ar: اكتب رسالتك هنا...
fr: Écrivez votre message ici...

source: Send
ar: إرسال
fr: Envoyer

# pleaseWriteMessage
source: Please write a message
ar: الرجاء كتابة رسالة
fr: Veuillez écrire un message

source: Failed to open mail app
ar: فشل فتح تطبيق البريد
fr: Impossible d'ouvrir l'application de messagerie

# welcomeEmoji
source: Welcome 👋
ar: مرحباً بك 👋
fr: Bienvenue 👋

# homeSubtitle
source: Browse faculties, calculate your GPA, share your ideas, and write notes easily.
ar: تصفح الكليات، احسب معدلك، شارك أفكارك، ودوّن ملاحظاتك بسهولة.
fr: Parcourez les facultés, calculez votre moyenne, partagez vos idées et notez facilement.

# searchFaculty
source: Search for a faculty...
ar: ابحث عن كلية...
fr: Rechercher une faculté...

# quickCalc
source: Quick Calculation
ar: الحساب السريع
fr: Calcul rapide

# welcomeUniSpace
source: Welcome to UniSpace
ar: مرحبًا بك في UniSpace
fr: Bienvenue sur UniSpace

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور
fr: Mot de passe

# resetSent
source: Reset link has been sent
ar: تم إرسال رابط إعادة التعيين
fr: Le lien de réinitialisation a été envoyé

# resetFailed
source: Failed to send: {e}
ar: تعذر الإرسال: {e}
fr: Échec de l'envoi : {e}

source: Not registered
ar: غير مسجّل
fr: Non enregistré

source: Pinned
ar: مثبّتة
fr: Épinglées

source: Other Notes
ar: باقي الملاحظات
fr: Autres notes

source: No posts yet
ar: لا توجد منشورات بعد
fr: Aucune publication pour le moment

# startDiscussion
source: Start the first discussion in the community and share your experience with colleagues.
ar: ابدأ النقاش الأول في المجتمع وشارك تجربتك مع زملائك.
fr: Commencez la première discussion dans la communauté et partagez votre expérience avec vos collègues.

# createPost
source: Post
ar: منشور
fr: Publication

source: New Post
ar: منشور جديد
fr: Nouvelle publication

# mediaUrl
source: Image/Video URL
ar: رابط صورة/فيديو
fr: Lien image/vidéo

source: Share
ar: مشاركة
fr: Partager

source: Report
ar: إبلاغ
fr: Signaler

# commentsCount
source: تعليقات ({count})
ar: Comments ({count})
fr: Commentaires ({count})

# writeComment
source: Write your comment…
ar: اكتب تعليقك…
fr: Écrivez votre commentaire…

# quickCalc2
source: Quick Calc
ar: حساب سريع
fr: Calcul rapide

source: Add
ar: إضافة
fr: Ajouter

source: Calculate
ar: احسب
fr: Calculer

# Pass
source: Passed
ar: ناجح
fr: Réussi

# Fail
source: Failed
ar: راسب
fr: Échoué

source: Credits:
ar: رصيد:
fr: Crédits :

source: System Mode
ar: حسب النظام
fr: Mode système

source: Dark Mode
ar: الوضع الداكن
fr: Mode sombre

source: Light Mode
ar: الوضع الفاتح
fr: Mode clair

# aboutAppDetails
source: UniSpace does not collect personal data outside Firebase. All data is secure.
ar: UniSpace لا يجمع بيانات شخصية خارج Firebase. جميع البيانات آمنة.
fr: UniSpace ne collecte pas de données personnelles en dehors de Firebase. Toutes les données sont sécurisées.

source: Choose Theme
ar: اختر المظهر
fr: Choisir le thème

source: Light
ar: فاتح
fr: Clair

source: Dark
ar: داكن
fr: Sombre

source: System
ar: حسب النظام
fr: Système

source: Choose Language
ar: اختر اللغة
fr: Choisir la langue

source: Arabic
ar: العربية
fr: Arabe

source: Register
ar: تسجيل
fr: S'inscrire

# post
source: Your post has been published ✅
ar: تم نشر منشورك ✅
fr: Votre publication a été publiée ✅

# createPoste
source: Create a post
ar: أنشئ منشوراً
fr: Créer une publication

source: One major
ar: تخصص واحد
fr: Une spécialité

source: No majors yet
ar: لا تخصصات مسجّلة بعد
fr: Aucune spécialité enregistrée pour le moment

source: Edit Weights
ar: تعديل الأوزان

# facultyEconomics
source: Faculty of Economics, Commerce, and Management Sciences
ar: كلية العلوم الاقتصادية والتجارية وعلوم التسيير
fr: Faculté des sciences économiques, commerciales et des sciences de gestion

# basicEducationDept
source: Basic Education Department
ar: قسم التعليم الأساسي
fr: Département de l'enseignement de base

source: Basic Education
ar: التعليم الأساسي
fr: Enseignement de base

# managementSciencesDept
source: Department of Management Sciences
ar: قسم علوم التسيير
fr: Département des sciences de gestion

source: Management Sciences
ar: علوم التسيير
fr: Sciences de gestion

source: Business Administration
ar: إدارة أعمال
fr: Administration des affaires

source: Financial Management
ar: الإدارة المالية
fr: Gestion financière

source: Human Resources Management
ar: إدارة موارد بشرية
fr: Gestion des ressources humaines

source: Corporate Financial Management
ar: التسيير المالي للمؤسسات
fr: Gestion financière des entreprises

# commercialSciencesDept
source: Department of Commercial Sciences
ar: قسم علوم تجارية
fr: Département des sciences commerciales

source: Commercial Sciences
ar: علوم تجارية
fr: Sciences commerciales

# financeInternationalTrade
source: Finance and International Trade
ar: مالية وتجارة دولية
fr: Finance et commerce international

source: Marketing
ar: تسويق

source: Services Marketing
ar: تسويق الخدمات
fr: Marketing des services

# hotelTourismMarketing
source: Hotel and Tourism Marketing
ar: تسويق فندقي وسياحي
fr: Marketing hôtelier et touristique

# financialAccountingDept
source: Department of Financial and Accounting Sciences
ar: قسم علوم مالية ومحاسبة
fr: Département des sciences financières et comptables

# financialAccounting
source: Financial and Accounting Sciences
ar: علوم مالية ومحاسبة
fr: Sciences financières et comptables

source: Finance
ar: مالية

source: Accounting
ar: محاسبة
fr: Comptabilité

# accountingTaxation
source: Accounting and Taxation
ar: محاسبة وجباية
fr: Comptabilité et fiscalité

source: Corporate Finance
ar: مالية المؤسسة
fr: Finance d'entreprise

# economicsDept
source: Department of Economics
ar: قسم علوم اقتصادية
fr: Département des sciences économiques

source: Economics
ar: علوم اقتصادية
fr: Sciences économiques

# monetaryFinancialEconomics
source: Monetary and Financial Economics
ar: اقتصاد نقدي ومالي
fr: Économie monétaire et financière

source: International Economics
ar: اقتصاد دولي
fr: Économie internationale

# noSubjectsThisSemester
source: No subjects in this semester.
ar: لا توجد مواد في هذا الفصل.
fr: Aucune matière dans ce semestre.

source: Coefficient:
ar: معامل:

source: Close
ar: إغلاق
fr: Fermer

source: Study Results
ar: نتائج الدراسة
fr: Résultats d'étude

# notesTdTpExam
source: Grades (TD/TP/Exam)
ar: العلامات (TD/TP/EXAM)
fr: Notes (TD/TP/Exam)

# facultyLawPolitical
source: Faculty of Law and Political Sciences
ar: كلية الحقوق والعلوم السياسية
fr: Faculté de droit et des sciences politiques

source: Political Sciences
ar: علوم سياسية
fr: Sciences politiques

source: Common Core
ar: جذع مشترك
fr: Tronc commun

source: Basic Unit
ar: الوحدة الأساسية
fr: Unité fondamentale

source: Methodological Unit
ar: الوحدة المنهجية
fr: Unité méthodologique

source: Exploratory Unit
ar: الوحدة الاستكشافية
fr: Unité exploratoire

source: Horizontal Unit
ar: الوحدة الأفقية
fr: Unité horizontale

# politicalAdministrativeOrgs
source: Political and Administrative Organizations
ar: تنظيمات سياسية وإدارية
fr: Organisations politiques et administratives

source: Law
ar: حقوق
fr: Droit

source: Public Law
ar: قانون عام
fr: Droit public

source: Private Law
ar: قانون خاص
fr: Droit privé

source: Advanced Public Law
ar: قانون عام معمق
fr: Droit public approfondi

source: Family Law
ar: قانون الأسرة
fr: Droit de la famille

# criminalLaw
source: Criminal Law and Criminal Sciences
ar: القانون الجنائي والعلوم الجنائية
fr: Droit pénal et sciences criminelles

source: Business Law
ar: قانون الأعمال
fr: Droit des affaires

# legalProfessionsLaw
source: Legal and Judicial Professions Law
ar: قانون المهن القانونية والقضائية
fr: Droit des professions juridiques et judiciaires

# maritimePortLaw
source: Maritime and Port Law
ar: القانون البحري والمينائي
fr: Droit maritime et portuaire

# energyMiningLaw
source: Energy and Mining Law
ar: قانون الطاقة والمناجم
fr: Droit de l’énergie et des mines

source: Tax Law
ar: قانون جبائي
fr: Droit fiscal

# beFirstToComment
source: Be the first to add a helpful reply.
ar: كن أول من يضيف ردًا مفيدًا.
fr: Soyez le premier à ajouter une réponse utile.

# filterUnanswered
source: Unanswered
ar: بدون إجابات
fr: Sans réponse

source: Create first post
ar: أنشئ أول منشور
fr: Créer la première publication

# noResultsTitle
source: No results
ar: لا توجد نتائج
fr: Aucun résultat

source: Clear search
ar: مسح البحث
fr: Effacer la recherche

source: Suggested tags
ar: وسوم مقترحة
fr: Tags suggérés

source: Add tag
ar: إضافة وسم
fr: Ajouter un tag

# opBadge
source: OP
ar: صاحب المنشور
fr: Auteur

source: Sort comments
ar: ترتيب التعليقات
fr: Trier les commentaires

# sortNewest
source: Newest
ar: الأحدث
fr: Les plus récents

# sortMostHelpful
source: Most helpful
ar: الأكثر فائدة
fr: Les plus utiles

# tagsHint
source: e.g. campus, clubs
fr: ex. #campus, #clubs
